blog/pulse-emacspeak.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-05 Sun 09:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacspeak: The Complete Audio Desktop Under Pulseaudio</title>
<meta name="author" content="T.V Raman" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacspeak: The Complete Audio Desktop Under Pulseaudio</h1>
<div id="outline-container-orgfabf488" class="outline-2">
<h2 id="orgfabf488"><span class="section-number-2">1.</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
Porting  Emacspeak sound environment to Pulseaudio.
</p>

<p>
Until now, emacspeak features that enhance the auditory display have
relied exclusively on ALSA and avoided Pulseaudio all together. As
Pulseaudio improves, and  simultaneously gets harder to get rid of, I
recently ported the required features to work under Pulseaudio, see
below for details.
</p>
</div>
</div>
<div id="outline-container-org0ab1466" class="outline-2">
<h2 id="org0ab1466"><span class="section-number-2">2.</span> Summary Of Auditory Display Enhancements</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Notifications, e.g., <i>speaking the time</i>, <i>incoming IM messages</i></li>
</ul>
<p>
etc. are spoken on a separate notification stream.
</p>
<ul class="org-ul">
<li>The above normally plays on the right ear, but enhanced with a
<i>binaural</i> effect.</li>
<li>This can be configured to be on the left ear when running
Emacspeak remotely on a cloud-top.</li>
<li>A <i>Bauer Stereo To Binaural</i> <a href="https://www.google.com/search?num=25&amp;lite=90586&amp;q=bs2b+bauer+Stereo+To+Binaural">(BS2B)</a>
filter is applied to all
output streams to provide an enhanced headphones listening experience.</li>
<li>The <i>outloud</i> server has been updated to request  lower latency
from Pulse; Pulseaudio defaults are too high for highly responsive
TTS.</li>
</ul>

<p>
For details on Emacspeak's enhancement to the auditory display, see
prior articles listed in the <i>References</i> section.
</p>
</div>
</div>

<div id="outline-container-orgc514147" class="outline-2">
<h2 id="orgc514147"><span class="section-number-2">3.</span> Configuring Pulseaudio To Enhance The Auditory Display</h2>
<div class="outline-text-2" id="text-3">
<p>
All of these features have been available until now by installing a
custom <code>.asoundrc</code>; these are now available under Pulseaudio by
installing a <code>.config/pulse/default.pa</code> in the user's home directory.
</p>

<pre class="example">
cp EMACSPEAK_DIR/etc/pulse/default.pa ~/.config/pulse; pulseaudio -k
</pre>


<p>
The above is a one-time operation that sets up the audio environment
&#x2014; see <a href="https://github.com/tvraman/emacspeak/blob/master/etc/pulse/README.org#L42">etc/pulse/README.org</a>.
</p>
</div>
</div>

<div id="outline-container-orgd96e5b7" class="outline-2">
<h2 id="orgd96e5b7"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li><a href="https://emacspeak.blogspot.com/2016/02/augmented-headphone-listening-on-linux.html">Augmented Headphone Listening On Linux For The Emacspeak Audio Desktop</a></li>
<li><a href="https://emacspeak.blogspot.com/2015/12/soundscapes-on-emacspeak-audio-desktop.html">Soundscapes On The Emacspeak Audio Desktop</a></li>
<li><a href="https://emacspeak.blogspot.com/2016/11/follow-up-soundscapes-on-emacspeak.html">Follow-Up: Soundscapes on the emacspeak Audio Desktop</a></li>
<li><a href="https://emacspeak.blogspot.com/2015/12/a-ladspa-work-bench-for-emacspeak.html">A Ladspa Work-Bench For The Emacspeak Desktop</a></li>
<li><a href="https://emacspeak.blogspot.com/2015/11/generating-spatialized-auditory-icons.html">Generating Spatialized Auditory Icons Using MPlayer And Ladspa</a></li>
<li><a href="https://emacspeak.blogspot.com/2015/11/listening-to-multiple-media-streams-on.html">Listening To Multiple Media Streams On The Emacspeak Audio Desktop</a></li>
<li><a href="https://emacspeak.blogspot.com/2015/11/using-multiple-tts-streams-on-emacspeak.html">Using Multiple TTS Streams On The emacspeak Audio Desktop</a></li>
<li><a href="https://emacspeak.blogspot.com/2015/02/enhanced-audio-on-emacspeak-desktop.html">Enhanced Audio On The Emacspeak Desktop</a></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2022-06-05 Sun 00:00</p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2022-06-05 Sun 09:16</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
